Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A39C.tmx
Source language: en_us
Languages: zh_cn

source: Stephen Curry wins his first 3-point shootout championship
zh_cn: 史蒂芬·库里赢得他的首个NBA全明星三分球大赛冠军

source: It has become popular, considering the NBA's marked improvement in 3-point marksmanship, to call the 3-point shootout the marquee event of not only the All-Star Saturday night lineup, but the entire weekend.
zh_cn: 随着NBA中的三分球投篮水平的显著提高，三分球大赛不仅是全明星赛周六晚上，而且也是整个周末的重头戏。

source: This year's competition didn't bust any records, and it did have some NBA-influenced mitigating factors, but the contest did follow through on its promise.
zh_cn: 今年的比赛没有打破任何记录，这其中有NBA影响力下降的因素，但是比赛还是如约进行。

source: Golden State Warriors superstar Stephen Curry hit for 27 points in the final round in a fantastic display to win his first Shootout trophy.
zh_cn: 金州勇士队的超级球星——史蒂芬·库里在最后一轮比赛中轰下27分，用一次惊艳的表现为自己赢得了首座三分球大赛冠军奖杯。

source: With a lineup featuring the NBA's leading scorer, last year's All-Star Game MVP, a player who recently set a record for points in a single quarter, last year's champion, two MVP candidates, and perhaps the greatest 3-point shooter ever, the shootout figured to be a sound draw.
zh_cn: 此次比赛聚集了NBA的顶尖得分手，其中包括去年全明星赛的最有价值球员、刚刚创造单节比赛得分纪录的球员、去年的总冠军球队成员、两位最有价值球员的有力竞争者以及可能是有史以来最伟大的三分球投手。这使得此次比赛极具吸引力。

source: By nature of the talent behind this group, however, James Harden (the league's leading scorer and an MVP candidate), the defending champion Marco Belinelli, Los Angeles Clippers sharpshooter J.J. Redick (who in a rare instance had two makes waved off after he stepped on the 3-point line, costing him three points), and even Kyle Korver (on pace to shatter the NBA record for 3-point percentage) were out in the first round.
zh_cn: 各位参赛选手天赋异禀，然而詹姆斯·哈登（联盟得分王及最有价值球员有力竞争者）、卫冕冠军球队的马尔科·贝利内里、洛杉矶快船队的射手J.J.罗迪克（罕见的是，因为踩线，他的两次投篮被取消，因此损失三分）以及凯尔·科沃尔（他的三分球命中率逼近NBA三分球命中率记录）均在第一轮出局。

source: Portland's Wesley Matthews scored 22 points in his first round, enough to usually win the shootout in some years, and he was still knocked out after his first go-round.
zh_cn: 波特兰开拓者的韦斯利·马修斯在第一轮得到在往年的比赛中可以获得冠军的22分，但他也止步第一轮。

source: It was fellow Warrior Klay Thompson (24 points in the first round), former shootout champion and 2014 All-Star Game MVP Kyrie Irving (23) and Curry (23) who would gear up for the final round.
zh_cn: 勇士队的克莱·汤普森（第一轮24分），往届三分球大赛冠军、2014年全明星赛最有价值球员凯里·欧文（23分）以及库里（23分）晋级最后一轮。

source: Irving managed just 18 points in his last turn, Curry caught fire to the tune of scoring 27 out of a possible 34 points (including 13 straight makes) just after, and Thompson disappointed by only hitting for 14 points as his fellow Splash Brother watched from the sidelines.
zh_cn: 欧文最后一轮仅获得18分，库里火力全开得到满分34分中的27分（包括连续命中13球），在另一位水花兄弟在场边的关注下，汤普森令人失望仅获得14分。

source: Curry leads the NBA in 3-point makes this season, and he led the league in both makes and attempts in 2013 and 2014, but oddly his current 3-point percentage would rank as the worst of his career if it sustains.
zh_cn: 本赛季，库里的三分球命中数领先全联盟，他在2013年和2014年的三分球投篮数和命中数也是全联盟之冠，但奇怪的是，他目前的三分球命中率却是职业生涯的最低。

source: At 39.9 percent, Stephen's mark would rank him as a lights-out sharpshooter in any other context, but after entering the season shooting a white-hot 44 percent from long range on his career, he's actually taking a small step back.
zh_cn: 39.9%的命中率使得史蒂芬在其他任何情况下都算是一个合格的远投手，但与他进入联盟后职业生涯令人瞩目的44%的远投命中率相比，他实际上有些许退步。

source: The Warriors don't mind.
zh_cn: 勇士队却不在意这些。

source: Not only is Curry the go-to scorer on what at times has ranked as the NBA's best offense, his all-around game has pushed him into the MVP discussion.
zh_cn: 作为核心得分手，库里不仅已经跻身NBA顶级得分手，而且凭借他全面的表现已经成为最有价值球员的大热人选。

source: Golden State entered the All-Star break with a fantastic 42-9 record, league-best mark that puts the team on pace for 68 wins.
zh_cn: 金州勇士在全明星赛前取得了42胜、9负的出色成绩，目前联盟最佳战绩使得他们向68胜的纪录迈进。

source: It should also be noted that Stephen Curry is also a really great guy.
zh_cn: 值得一提的是，史蒂芬·库里也是一个非常好的人。

source: One drawback during an otherwise fun time out was the NBA's move to run the TNT commentary of Kenny Smith and Reggie Miller into the Barclays Center's public address feed.
zh_cn: 欢乐时光之余的一个不足就是NBA将TNT评论员肯尼·史密斯和雷吉·米勒请进了巴克莱中心的广播室。

source: Not only did their insipid back and forth reek of pointless radio-chat-show yammering, but the league did the festivities one step worse - there was actual canned crowd noise, obviously fake applause, being fed into the speakers and/or TNT broadcast feed after every make.
zh_cn: 他们平淡无奇、反反复复地进行着类似于广播中充满抱怨的谈话，但更糟糕的是，每次得分后，话筒或TNT转播中都会播放一些提前录制的观众音效，甚至是一些特别假的掌声。
